{"name":"Dancing on a Totem Pole","description":" Dancin\u0027 on a Totem Pole\nExplore Totemic and fight its boss Baykok. ","quests":[{"uuid":"a3418584-f303-42f2-bbcb-e2ca7718d9cf","name":"Jingle-Jingle!","description":"Craft a Jingle Dress! Wearing this in your leg slot will increase your musical performance while moving during Rituals.\n\nFor more information on Ceremonies, refer to the previous quest!","x":40,"y":85,"icon":{"id":"totemic:jingle_dress"},"prerequisites":["9ae3b782-d0e2-42fe-8aa0-5f486b623fe9"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:jingle_dress"},"precision":"NBT_FUZZY"}]}],"rewardchoice":[{"id":"minecraft:iron_ore","amount":20},{"id":"thermalfoundation:ore","amount":20}],"commandrewards":[]},{"uuid":"4bd46f4d-74b1-4d2f-bae4-1f1b54e900d3","name":"Chime! Wait For Me!","description":"Craft lots of Wind Chimes. Hang them up near your Totem Pole for passive music generation. Watch out though, you should have no blocks beneith a Chime! Chimes also have preferred spots, meaning you can\u0027t just place them anywhere. After placing one, try Shift+Right Clicking on one. If it makes a sound: It\u0027s a preferred spot. If it doesn\u0027t, you\u0027ll need to move it for it to have an effect.\n\nNote: The quest only asks for 4 Wind Chimes, however, for better performance, you might need more.","x":108,"y":54,"icon":{"id":"totemic:wind_chime"},"prerequisites":["9ae3b782-d0e2-42fe-8aa0-5f486b623fe9","5ab3e3ae-de4e-42c1-920a-7ac9d2d3731c"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:wind_chime"},"required":4}]}],"reward":[{"id":"extrautils2:soundmuffler","amount":2}],"commandrewards":[]},{"uuid":"88a757d8-9a03-4d57-be33-4242a69d3922","name":"Just Rattle on","description":"Now that you have access to Buffalo Teeth, craft a Rattle! By offhanding it or the Flute, you can create even more music for your Rituals!","x":233,"y":53,"icon":{"id":"totemic:rattle"},"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:rattle"}}]}],"reward":[{"id":"minecraft:compass","nbt":"{\"quark:compass_calculated\":1b,\"quark:compass_in_nether\":0b}"}],"rewardchoice":[{"id":"ironbackpacks:upgrade","nbt":"{upgrade:\"ironbackpacks:extra_upgrade\"}"},{"id":"ironbackpacks:upgrade","nbt":"{upgrade:\"ironbackpacks:everlasting\"}"}],"commandrewards":[]},{"uuid":"4da97099-adc9-4e2a-9288-879e1d7d657d","name":"Buffalo buffalo buffalo.","description":"Now you are tasked to perform the Buffalo Dance Ritual, while having a few Cows nearby in a pen! If performed succesfully, exactly 2 Cows in the vacinity will transform into Baby Buffalos!\n\nNote: You\u0027ll likely need all the previously mentioned instruments to have a chance to complete this Ritual: A Flute, 2 Drums, at least 4 well-placed Wind Chimes and a Jingle Dress.\n\nYou can speed up the growth of Baby Buffalos by feeding them Wheat. You can also breed adult Buffalos using Wheat, like you would do with regular Cows. Once you kill an adult Buffalo, and obtain the required items, you can turn in this quest.\n\n----------------------------\n\n\"Bison from Buffalo, which other bison from Buffalo confuse, confuse the bison from Buffalo.\"\n\nor,\n\n\"Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo.\"","x":192,"y":53,"icon":{"id":"totemic:buffalo_items","damage":1},"prerequisites":["4bd46f4d-74b1-4d2f-bae4-1f1b54e900d3"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:buffalo_items","damage":1}},{"item":{"id":"totemic:buffalo_items"}},{"item":{"id":"totemic:buffalo_meat"}}]}],"reward":[{"id":"openblocks:golden_egg"}],"commandrewards":[]},{"uuid":"dcfe8fcf-cea8-498e-a4e5-908275f94e8f","name":"Your Wrench for Totemic","description":"Craft a Totemic Staff! This tool can be used to Right Click on Totems and Totem Bases to display some information about effects and ongoing Rituals, but more importantly, this tool can be used to stop a Ceremony by Left Clicking on a Totem Base.","x":82,"y":22,"icon":{"id":"totemic:totemic_staff"},"prerequisites":["9ae3b782-d0e2-42fe-8aa0-5f486b623fe9"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:totemic_staff"}}]}],"rewardchoice":[{"id":"minecraft:bone","amount":10},{"id":"minecraft:string","amount":10}],"commandrewards":[]},{"uuid":"d9f33cbb-3efe-4554-9599-47a85b851930","name":"James Galway would be proud","description":"Craft a Flute! This can help you with Totemic Ceremonies by generating music via Right Clicks, and you\u0027ll need it to start certain Ceremonies by Shift+Right Clicking.\n\nFor more information on Ceremonies, refer to the previous quest!","x":60,"y":124,"icon":{"id":"totemic:flute"},"prerequisites":["9ae3b782-d0e2-42fe-8aa0-5f486b623fe9"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:flute","nbt":"{cooldown:0}"},"precision":"NBT_FUZZY"}]}],"reward":[{"id":"storagedrawers:framingtable"},{"id":"storagedrawers:shroud_key"}],"commandrewards":[]},{"uuid":"c73156e9-8672-405e-a213-364e2a3f9d3d","name":"Symbolism","description":"Now you are tasked to perform the Eagle Dance Ritual. This will turn exactly 2 nearby Parrots into Bald Eagles. To complete this quest, unfortunately you\u0027ll have to stab-stab or shoot-shoot this wonderful creatures and collect some Eagle Bones and Eagle Feathers!\n\nTo more easily find Parrots, they have been added as base spawns to multiple biomes. These include: Arid Highland, Autumnal Wooded Hills, Autumnal Woods, Canyon, Desert Shrubland, Lush Hills, Lush Swamp, Magical Forest, Mini Jungle, Savanna (all variants), Swampland (all variants) \u0026 Temperate Rainforest. Additionally, Parrot spawnrates have been increased in all Jungle variants.","x":234,"y":124,"icon":{"id":"totemic:eagle_drops","damage":1},"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:eagle_drops"}},{"item":{"id":"totemic:eagle_drops","damage":1}}]}],"reward":[{"id":"extrautils2:boomerang"}],"rewardchoice":[{"id":"minecraft:record_stal"},{"id":"minecraft:record_ward"}],"commandrewards":[]},{"uuid":"84b66d92-ab78-43eb-b054-6b012e674608","name":"Tipiddy top","description":"Sleepidy sleep! - is what you can do in your new Tipi.\n\n(Or you can alternatively just craft a Bed, if you don\u0027t wanna embrace the Totemic lifestyle... Its recipe has also been unlocked by gaining access to Buffalo Hide!)","x":212,"y":21,"icon":{"id":"totemic:tipi"},"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:tipi"}}]}],"reward":[{"id":"openblocks:slimalyzer"}],"commandrewards":[]},{"uuid":"ebc175f3-b83e-4284-8187-c9311eb9ae8a","name":"Can you blow my Whistle baby","description":"Craft your final musical instrument, an Eagle-Bone Whistle! Now you\u0027ll have 3 handheld instruments to swap between. It is recommended to use all of them though, so try to swap between 2 in your main hand while performing Rituals!","x":234,"y":165,"icon":{"id":"totemic:eagle_bone_whistle"},"prerequisites":["c73156e9-8672-405e-a213-364e2a3f9d3d"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:eagle_bone_whistle"},"precision":"NBT_FUZZY"}]}],"rewardchoice":[{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:3s,id:65s}]}"},{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:2s,id:25s}]}"}],"commandrewards":[]},{"uuid":"79b3a89a-9680-4c74-9204-b6739e24f1e1","name":"Shiny Flute","description":"Now you are tasked to perform the Serenade of Syrinx. This will infuse any Flute in your inventory with magical powers and turn them into Pan\u0027s Flute. Using Pan\u0027s Flute you can more easily complete Ceremonies.","x":273,"y":53,"icon":{"id":"totemic:flute","damage":1,"nbt":"{cooldown:0}"},"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:flute","damage":1},"precision":"NBT_FUZZY"}]}],"rewardchoice":[{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:3s,id:59s}]}"},{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:3s,id:27s}]}"}],"commandrewards":[]},{"uuid":"a961d666-47cf-4ca3-bb99-323fc88cb9b1","name":"Mobile buffs","description":"Craft a Medicine Bag! You can use it to Shift+Right Click on any type of Totem, and gain its effect. Then, by Right Clicking with the Medicine Bag, you can change it between an Open and Closed state. While open, the effect is constantly being used up, and while closed, the player won\u0027t gain the effect. To recharge the Bag, simply stand near your Totem Pole.\n\nNote: The Ocelot effect cannot be bound to a Medicine Bag.","x":192,"y":124,"icon":{"id":"totemic:medicine_bag"},"prerequisites":["5ab3e3ae-de4e-42c1-920a-7ac9d2d3731c","4da97099-adc9-4e2a-9288-879e1d7d657d"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:medicine_bag"},"precision":"NBT_FUZZY"}]}],"reward":[{"id":"divinerpg:healing_stone"}],"commandrewards":[]},{"uuid":"2c99d332-9180-424c-a548-25bd0fec442d","name":"The Start of Totemic","description":"   ------------------------\n    THIS QUEST IS MAINLY FOR\n     INFORMATION ON TOTEMIC\n   ------------------------\n\nYou can use your Totem Whittling Knife on any vanilla Log block to transform it into a Totem Base.\n\nYou can Shift+Right Click or Shift+Scroll Wheel on your Totem Whittling Knife to switch between Totem options. Carve any vanilla Log type (or Red Cedar) above a Totem Base to create a Totem of a specific kind. Totem poles can only be at most 6 blocks high (including the base). Various animals carved out give small area-of-effect buffs (the effect area is an 11x11x11 block cube centered at the Totem Base), similar to a small-range Beacon. To find out what gives what, please read the Totems and Effects -\u003e Totem Effects chapter of your Totempedia.\n\nTotem effects can stack up to the 3rd level of a given effect (like Speed III, Jump Boost III, etc.), if you build a max height Totem of all the same animal tpye. Level II can be achived with 3 totems on the same Totem Pole.\n\nLater you\u0027ll be able to craft a Medicine Bag, shift right click on a Totem, and gain its effect while the Medicine Bag is open (for about 4 minutes).","x":40,"y":22,"icon":{"id":"totemic:totem_base"},"prerequisites":["449a5f0a-6861-4682-8893-639676733921"],"tasks":[{"type":"COMPLETION","completed_quests":[{"quest_uuid":"449a5f0a-6861-4682-8893-639676733921"}]}],"reward":[{"id":"akashictome:tome"}],"commandrewards":[]},{"uuid":"9ae3b782-d0e2-42fe-8aa0-5f486b623fe9","name":"Musical Instruments","description":"To complete the quest, craft 2 Totemist Drums! Read on for more information about Musical Instruments and Ceremonies:\n\nTo start a Ceremony, you need to be close to a Totem Pole. Place down some Drums (2 is likely enough), lots of Wind Chimes, and hold some musical instruments in your main- and off-hand like a Flute, and later a Rattle and an Eagle-Bone Whistle.\n\nTo actually begin a Ceremony, Shift+Right click with or on a musical instrument. Check the Ceremonies Chapter of your Totempedia for a detailed explanation on each Ceremony. It shows yo which instrument(s) you need to Shift+Right Click on, to start a certain Ritual.\n\nThe first Ritual it explains is the War Dance. If you haven\u0027t played with Totemic yet, I recommend you try it: Shift+Right Click twice on a Drum to start it. Now you\u0027ll see two bars on your screen slowly filling up. You need to fill up the top bar, before your time runs out: which is measured on the bottom bar. To use musical instruments, simply Right Click with or on them. You should see the top bar filling up.\n\nIf you do it succesfully, you\u0027ll earn the benefits of the given Ritual; in the case of the War Dance, Strength and Speed for 3 minutes.\n\nFailing a Ritual? There can be multiple things going wrong:\n\n1. Each musical instrument has a short cooldown to use, so you can\u0027t just spam one Drum and expect the Ritual to complete.\n\n2. Variety helps! Try using a Flute besides the Drum, constantly swapping between the two. Note: You can click the Drum while holding the Flute.\n\n3. For even more complex Ceremonies, try crafting passive music generating instruments: Wind Chimes, as well as a Jingle Dress, which you can move around with to generate more music.","x":60,"y":55,"icon":{"id":"totemic:drum"},"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:drum"},"required":2}]}],"rewardchoice":[{"id":"minecraft:egg","amount":8},{"id":"minecraft:dye","amount":4}],"commandrewards":[]},{"uuid":"5ab3e3ae-de4e-42c1-920a-7ac9d2d3731c","name":"Rite of Spring","description":"You are now tasked to perform the Rite of Spring while some Saplings are nearby. This will transform these Saplings into Red Cedar Saplings. The Ritual has additional effects, please read up on them in your Totempedia. Once you\u0027ve obtained at least one Red Cedar Sapling, pick it up to complete this quest. You can now plant these Saplings and grow them normally with Bone Meal, etc.\n\nNote: It is recommended to place some blocks above the affected Saplings, so they don\u0027t grow while you\u0027re performing the Ritual. Additionally, some modded Saplings do work, some don\u0027t. Here is a list of both:\n\nSaplings that CAN be transformed: Minecraft, Natura, AbyssalCraft, Bewitchment, Erebus, Traverse. \n\nSaplings that CANNOT be transformed: Quark, Tinkers\u0027 Slime Saplings, Twilight Forest, Atum 2, Aether Legacy, Roots, DivineRPG, Extra Utilities 2, Thaumcraft.","x":109,"y":124,"icon":{"id":"totemic:cedar_sapling"},"prerequisites":["d9f33cbb-3efe-4554-9599-47a85b851930"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:cedar_sapling"}}]}],"reward":[{"id":"actuallyadditions:block_giant_chest_medium"}],"commandrewards":[]},{"uuid":"4eb44f29-3e08-4d4a-bc9b-ca0cab5cc3eb","name":"BOSSFIGHT: Baykok","description":"Perform the Totentanz Ritual to summon Baykok. Before you do though, make some preparations:\n\n1. Baykok shoots arrows constantly, so equip some armor that can handle it. It\u0027s also recommended to use a ranged weapon if you want to fight it head to head.\n\n2. You can setup some kind of a hidey hole where you get can into, but Baykok can\u0027t. Baykok can\u0027t activate buttons, trapdoors, or break blocks.\n\nOnce you have defeated Baykok, he will drop his Bow. You can use this bow with regular arrows, or use it for upcoming crafting recipes. Both of these actions will require 1 durability per shot or craft.","x":272,"y":162,"bigicon":true,"icon":{"id":"totemic:baykok_bow"},"prerequisites":["ebc175f3-b83e-4284-8187-c9311eb9ae8a"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"totemic:baykok_bow"},"precision":"NBT_FUZZY"}]}],"reward":[{"id":"testdummy:dummy"},{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:5s,id:48s}]}"},{"id":"actuallyadditions:item_solidified_experience","amount":64},{"id":"minecraft:diamond","amount":12}],"rewardchoice":[{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:4s,id:60s}]}"},{"id":"minecraft:enchanted_book","nbt":"{StoredEnchantments:[{lvl:1s,id:51s}]}"}],"commandrewards":[]}],"reputationBar":[]}